In [1]:
# Initialize the workspace
from pymongo import MongoClient
import pprint
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

In [3]:
client = MongoClient()

In [4]:
db = client['eia_data']

In [5]:
oil_produced = db['oil_produced']
natural_gas_produced = db['natural_gas_produced']
natural_gas_flared = db['natural_gas_flared']

In [7]:
oil_produced.count_documents({})

1

In [104]:
df_op = pd.DataFrame(oil_produced.find())
df_op.to_csv('/home/ubuntu/wasted_energy/df_op.csv')

In [105]:
df_ngf = pd.DataFrame(natural_gas_flared.find())
df_ngf.to_csv('/home/ubuntu/wasted_energy/df_ngf.csv')

In [106]:
df_ngp = pd.DataFrame(natural_gas_produced.find())
df_ngp.to_csv('/home/ubuntu/wasted_energy/df_ngp.csv')

In [108]:
pd.read_csv('/home/ubuntu/wasted_energy/csv_files/df_op.csv')
pd.read_csv('/home/ubuntu/wasted_energy/csv_files/df_ngp.csv')
pd.read_csv('/home/ubuntu/wasted_energy/csv_files/df_ngf.csv')

,Unnamed: 0,_id,us,alaska,alaska onshore,alaska state offshore,arkansas,california,california onshore,california state offshore,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
0,0,5f16fb110a23ba36aa93a1db,"['', '', '', '', '', '', '392,528', '526,159',...","['', '', '', '', '', '', '', '11,390', '24,258...","['', '', '9,481', '11,262', '8,733', '7,105', ...","['', '', '4,616', '11,224', '4,507', '1,631', ...","['', '', '', '', '', '', '', '997', '895', '1,...","['', '', '', '', '', '', '', '3,565', '2,780',...","['', '', '751', '580', '830', '1,250', '1,268'...","['', '', '', '0', 'NA', 'NA', 'NA', 'NA', '0',...",...,"['', '', '', '', '', '', '', '1,861', '1,120',...","['', '', '', '', '', '', '', '7,098', '5,910',...","['', '', '', '', '', '', '', '0', 'NA', 'NA', ...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '0', '', '', '', '', '', '', '', '', '', ...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '', '', '', '', '', '-', '0', '0', '0', '...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '', '', '', '', '', '', '0', '0', '0', '0..."

In [110]:
df_op = df_op.loc[ : , 'us' : ]
df_ngp = df_ngp.loc[ : , 'us' : ]
df_ngf = df_ngf.loc[ : , 'us' : ]

In [112]:
op_cols = df_op.columns
for val in df_op["us"]:
    us_ = val[130:]

In [113]:
df_op_exp = df_op.set_index('us').apply(lambda x: pd.Series(x[0]))
df_ngp_exp = df_ngp.set_index('us').apply(lambda x: pd.Series(x[0]))
df_ngf_exp = df_ngf.set_index('us').apply(lambda x: pd.Series(x[0]))

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 1652, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 1652, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 1652, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

In [114]:
#clean up oil produced data
df_op_exp.insert(0, 'year', range(1980, 2020)) 
df_op_exp.insert(1, 'us', us_)
df_op_exp.drop(0, axis=0, inplace=True)
for col_name in ['padd 1', 'padd 2', 'padd 3', 'padd 4', 'padd 5']:
    df_op_exp.drop(col_name, axis=1, inplace=True)

In [147]:
df_op_exp.head()

,year,us,florida,new york,pennsylvania,virginia,west virginia,illinois,indiana,kansas,...,montana,utah,wyoming,alaska,south alaska,north slope,arizona,california,nevada,federal offshore (padd 5)
1,1981,"3,128,624","34,773",841,"3,729",13,"3,473","24,090","4,721","65,810",...,"30,813","25,860","130,563","587,337","31,072","556,265",357,"365,370",700,"19,588"
2,1982,"3,156,715","25,626",834,"4,282",49,"3,227","27,710","5,563","70,525",...,"30,921","22,440","118,300","618,910","27,404","591,506",335,"373,176",613,"28,396"
3,1983,"3,170,999","19,476",831,"4,282",65,"3,628","29,200","5,321","71,594",...,"29,225","29,534","118,303","625,527","24,769","600,758",237,"374,161",810,"30,527"
4,1984,"3,249,696","14,462",840,"4,284",32,"3,524","28,868","5,526","75,729",...,"29,761","34,689","124,269","630,401","21,983","608,418",215,"381,621","1,907","30,399"
5,1985,"3,274,553","11,458","1,071","4,851",26,"3,555","30,265","5,168","75,407",...,"29,768","40,792","128,514","666,233","16,946","649,287",175,"394,002","3,039","29,875"

In [158]:
#clean up NG produced data
for x in df_ngp['us']:
    us_ngp = x
    #print(len(x))
#df_ngp_exp.insert(0, 'year', range(1960, 2020)) 
#df_ngp_exp.insert(1, 'us', x[30:])
df_ngp

,us,us offshore,us state offshore,federal offshore us,alaska,alaska onshore,alaska offshore,alaska state offshore,arkansas,california,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
0,"[, , , , , , 2,691,512, 3,084,567, 3,108,858, ...","[, , , , , , , 3,932,196, 5,111,413, 5,603,025...","[, , , , , , , , 755,671, 780,911, 747,743, 70...","[, , , , , , , 3,932,196, 4,355,742, 4,822,114...","[, , , , , , , 65,817, 99,303, 149,647, 217,85...","[, , 2,409,336, 2,545,144, 2,861,599, 3,256,35...","[, , , , , , , , 72,813, 71,946, 63,355, 71,47...","[, , , , , , , , 72,813, 71,946, 63,355, 71,47...","[, , , , , , , 127,529, 162,155, 175,335, 183,...","[, , , , , , , 861,320, 816,925, 767,342, 727,...",...,"[, , , , , , , 43,092, 43,930, 38,690, 40,038,...","[, , , , , , , 181,309, 171,617, 168,714, 157,...","[, , , , , , , 0, 0, 0, 0, 22, 9, 33, 33, 30, ...","[, , , , , , , 10,082, 9,329, 7,416, 6,309, 5,...","[, 53, 30, 21, 16, 13, 11, 9, 9, 8, 7, 7, 6, 6...","[, , , , , , , 3,837, 4,632, 4,861, 3,358, 2,2...","[, , , , , , , , , 2, 5, 5, 3, 3, 2,790, 4,080...","[, , , , , , , 0, 0, 0, 0, 9, 8, 10, 48, 39, 5...","[, , , , , , , 0, 0, 0, 0, 497, 205, 185, 393,...","[, , , , , , , 3,818, 3,389, 2,846, 2,805, 2,6..."